ci4/app/Controllers/Artikel.php

SELECT *
FROM `artikel`
---
    public function index()
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();
        // Pagination juga bisa diterapkan di sini jika artikel sudah banyak
        $artikel = $model->paginate(10);

SELECT *
FROM `artikel`
WHERE `slug` = 'artikel-pertama'
 LIMIT 1
---
    public function view($slug)
    {
        $model = new ArtikelModel();
        $artikel = $model->where(['slug' => $slug])->first();